import type { Promo } from "./types";

export const promoMockData: Promo[] = [
  {
    id: "1",
    slug: "1",
    title: "Случайный текст похож на глас грядущего поколения",
    description:
      "Есть над чем задуматься: предприниматели в сети интернет являются только методом политического участия и функционально разнесены на независимые элементы. Как уже неоднократно упомянуто, активно развивающиеся страны третьего мира разоблачены. Также как убеждённость некоторых оппонентов требует анализа новых принципов формирования материально-технической и кадровой базы.",
    image: "url",
    dueDate: "3.03.2026",
    status: "live",
    likeCount: 123,
  },
  {
    id: "2",
    slug: "2",
    title: "Реализация намеченных плановых заданий разочаровала",
    description:
      "Также как начало повседневной работы по формированию позиции напрямую зависит от первоочередных требований. Таким образом, укрепление и развитие внутренней структуры способствует повышению качества поставленных обществом задач. Повседневная практика показывает, что убеждённость некоторых оппонентов способствует подготовке и реализации глубокомысленных рассуждений.",
    image: "url",
    dueDate: "15.02.2026",
    status: "live",
    likeCount: 123,
  },
  {
    id: "3",
    slug: "3",
    title: "Консультация с широким активом даёт нам право принимать самостоятельные решения",
    description:
      "В частности, постоянное информационно-пропагандистское обеспечение нашей деятельности говорит о возможностях глубокомысленных рассуждений. С другой стороны, социально-экономическое развитие обеспечивает широкому кругу (специалистов) участие в формировании поэтапного и последовательного развития общества. Предварительные выводы неутешительны: глубокий уровень погружения представляет собой интересный эксперимент проверки новых предложений.",
    image: "url",
    dueDate: "2.01.2026",
    status: "live",
    likeCount: 123,
  },
];
